cask_args appdir: '/Applications'
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

# development
brew "git"
brew "telnet"
brew "coreutils"
brew "jq"
brew "fzf"
brew "yarn"
brew "zsh"
brew "bash"
brew "pandoc"
brew "tree"
brew "circleci"
brew "kubectl"
brew "rsync"
brew "zellij"
brew "duckdb"
brew "vim"
brew "neovim"
brew "bat"

# pyenv dependencies
brew "openssl@3"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

# env managers
brew "pyenv"
brew "pyenv-virtualenv"
brew "goenv", args: ["HEAD"]
brew "rbenv"
brew "tfenv"

# casks
cask "iterm2"
cask "docker"
cask "firefox"
cask "arc"
cask "font-fira-code"
cask "bitwarden"
cask "keepassxc"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "tidal"
cask "zoom"
cask "visual-studio-code"
