cask_args appdir: '/Applications'

# version control
brew "git"
brew "gh"

# shells & prompt
brew "zsh"
brew "bash"
brew "fish"
brew "starship"

# editors
brew "vim"
brew "helix"

# cloud & infrastructure
brew "kubectl"
brew "awscli"

# cli utilities
brew "coreutils"
brew "jq"
brew "yq"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "tree"
brew "parallel"
brew "telnet"
brew "pandoc"
brew "duckdb"

# languages & package managers
brew "go"
brew "uv"
brew "node"
brew "tenv"

# dev tools
cask "ghostty"
cask "docker-desktop"
cask "visual-studio-code"
cask "cursor"
cask "claude-code"

# browsers
cask "firefox"
cask "zen"
cask "google-chrome"

# fonts
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"

# productivity & media
cask "bitwarden"
cask "obsidian"
cask "rectangle"
cask "tidal"
cask "slack"
