cask_args appdir: '/Applications'
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-cask"
tap "homebrew/cask-drivers"

# packages
brew "git"
brew "node"
brew "pyenv"
brew "pyenv-virtualenv"
brew "sqlite"
brew "telnet"
brew "yarn"
brew "zsh"
# casks
cask "datagrip"
cask "firefox"
cask "font-fira-code"
cask "gimp"
cask "google-chrome"
cask "keepassxc"
cask "logitech-options"
cask "microsoft-office"
cask "mysqlworkbench"
cask "postman"
cask "pycharm"
cask "slack"
cask "spotify"
cask "spotify-notifications"
cask "tableau"
cask "tableau-prep"
cask "tunnelblick"
cask "visual-studio-code"
cask "zoomus"