cask_args appdir: '/Applications'
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

# packages
brew "git"
brew "node"
brew "telnet"
brew "yarn"
brew "zsh"
brew "pandoc"
brew "tree"

# pyenv and dependencies
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "pyenv"
brew "pyenv-virtualenv"

# k8s
brew "kubectl"
brew "helm"
brew "minikube"

# browsers and apps
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "keepassxc"
cask "logitech-options"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "zoom"

# IDEs and editors
cask "datagrip"
cask "visual-studio-code"
